# The Pandas Series Object

A Pandas `Series` is a one-dimensional arrays of indexed data.

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.Series([0.25, 0.5, 0.75, 1.])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [3]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [5]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
data[1]

np.float64(0.5)

In [7]:
data[1:3]

1    0.50
2    0.75
dtype: float64

## `Series` as generalized NumPy array

the essential difference between `Series` object and one-dimensional NumPy array is that: while the np array has *implicitly defined* integer index used to access the values, the Pandas `Series` has an *explicitly defined* index associated with the values.

This explicit index definition gives the `Series` object additional capabilities.

In [8]:
data = pd.Series([0.25, 0.5, 0.75, 1.],
                 index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [9]:
data['a']

np.float64(0.25)

In [10]:
data['d']

np.float64(1.0)

In [11]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=[2, 5, 3, 7])
data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

In [12]:
data[5]

np.float64(0.5)

## Series as specialized dictionary

a `Series` is a structure which maps typed keys to a set of typed values. This typing is important: just as the type-specific compiled code behind a NumPy array makes it more efficient than a Python list for certain operations, the type information of a Pandas `Series` makes it much more efficient than Python dictionaries for certain operations.

The `Series`-as-dictionary analogy can be made even more clear by constructing a `Series` object directly from a Python dictionary:

In [13]:
population_dict = {'California' : 28342525,
                   'Texas' : 1232343,
                   'New York' : 19334,
                   'Florida' : 1232434,
                   'Illinois' : 3432442}
population = pd.Series(population_dict)
population

California    28342525
Texas          1232343
New York         19334
Florida        1232434
Illinois       3432442
dtype: int64

In [15]:
population['New York'].item()

19334

Unlike a Python dictionary, the `Series` supports array-style operations such as slicing:

In [16]:
population['California':'Florida']

California    28342525
Texas          1232343
New York         19334
Florida        1232434
dtype: int64

## Constructing Series objects

In [17]:
pd.Series([2, 3, 4])

0    2
1    3
2    4
dtype: int64

In [18]:
# data arg can be a scalar
pd.Series(3, index=[100, 200, 300])

100    3
200    3
300    3
dtype: int64

In [21]:
# data arg as a dict
# populated only with the explicit identified keys
pd.Series({2 : 'a', 3 : 'b', 4 : 'c'}, index=[3, 2])

3    b
2    a
dtype: object

# the Pandas DataFrame Object

## DataFrame as a generalized NumPy Array

`DataFrame` is an analog of a two-dimensional array with both flexible row indices and flexible column names. A two-dimensional array can be thought as an ordered sequence of aligned one-dimensional columsn, and DataFrame can be thought as a sequence of aligned `Series` objects. meaning they share the same index.

In [22]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [23]:
states = pd.DataFrame({'population' : population,
                       'area' : area})
states

            population    area
California    28342525  423967
Texas          1232343  695662
New York         19334  141297
Florida        1232434  170312
Illinois       3432442  149995

In [24]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [27]:
states['population']

California    28342525
Texas          1232343
New York         19334
Florida        1232434
Illinois       3432442
Name: population, dtype: int64

In [29]:
states.columns

Index(['population', 'area'], dtype='object')

## DataFrame as specialized dictionary

A DataFrame maps a column name to a Series of columns data.

In [33]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

## Constructing DataFrame objects

### From a single Series object

In [34]:
pd.DataFrame(population, columns=['population'])

            population
California    28342525
Texas          1232343
New York         19334
Florida        1232434
Illinois       3432442

### From a list of dicts

In [35]:
data = [{'a': i, 'b': 2 * i}
        for i in range(3)]
data

[{'a': 0, 'b': 0}, {'a': 1, 'b': 2}, {'a': 2, 'b': 4}]

In [36]:
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

In [38]:
# missing values for keys, filled with NaN
pd.DataFrame([{'a': 1, 'b': 2},
              {'b': 3, 'c': 4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

### From a dictionary of Series objects

In [39]:
pd.DataFrame({'population': population,
              'area': area})

            population    area
California    28342525  423967
Texas          1232343  695662
New York         19334  141297
Florida        1232434  170312
Illinois       3432442  149995

### From a two-dimensional array

In [40]:
pd.DataFrame(np.random.rand(3, 2),
             columns=['foo', 'bar'],
             index=['a', 'b', 'c'])

        foo       bar
a  0.740665  0.830965
b  0.414922  0.604048
c  0.453683  0.608704

### From a NumPy structured array

In [41]:
A = np.zeros(3, dtype=[('A', 'i8'), ('B', 'f8')])
A

array([(0, 0.), (0, 0.), (0, 0.)], dtype=[('A', '<i8'), ('B', '<f8')])

In [42]:
pd.DataFrame(A)

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

# The Pandas Index Object

We have seen that both the `Series` and `DataFrame` objects contain an explicit *index* that lets us reference and modify data. This `index` object is an interesting structure in itself, and it can be thought of either as an *immutable array* or an *ordered set* (technically a multi-set, as Index object may contain repeated values). Those views have some interesting consequences in the operations available on Index objects.

In [43]:
ind = pd.Index([2, 3, 5, 7, 11])
ind

Index([2, 3, 5, 7, 11], dtype='int64')

## Index as immutable array

In [44]:
ind[1]

np.int64(3)

In [45]:
ind[::2]

Index([2, 5, 11], dtype='int64')

In [46]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

5 (5,) 1 int64

One difference between Index object and NumPy array is that indices are immutable, that they cannot be modified via normal means:

In [47]:
ind[1] = 0

TypeError: Index does not support mutable operations

## Index as ordered set

Pandas objects are designed to facilitate operations such as joins across datasets, which depend on many aspects of set arithmetic. The Index object follows many of the conventions used by Python's built-in set data structure, so that unions, intersections, differences, and other combinations can be computed in a familar way:

In [48]:
indA = pd.Index([1, 3, 5, 7, 9])
indB = pd.Index([2, 3, 5, 7, 11])

In [53]:
indA & indB # not correct anymore because this performs bitwise op

Index([0, 3, 5, 7, 9], dtype='int64')

In [54]:
indA.intersection(indB)

Index([3, 5, 7], dtype='int64')

In [55]:
indA | indB # same reason

Index([3, 3, 5, 7, 11], dtype='int64')

In [56]:
indA.union(indB)

Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [57]:
indA ^ indB

Index([3, 0, 0, 0, 2], dtype='int64')

In [58]:
indA.difference(indB)

Index([1, 9], dtype='int64')

# Data Indexing and Selection

## Data Selection in Series

### Series as dictionary

Like a dictionary, the `Series` object provides a mapping from a collection of keys to a collection of values:

In [59]:
data  = pd.Series([0.25, 0.5, 0.75, 1.],
                  index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [60]:
data['b']

np.float64(0.5)

In [61]:
# Examine keys/indices and values with Python
'a' in data

True

In [62]:
'v' in data

False

In [64]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [67]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [70]:
# modify with a dictionary-like syntax
# extend the object
data['e'] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

### Series as one-dimensional array

In [71]:
# slicing by explicit index
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [72]:
# slicing by implicit integer index
data[0:2]

a    0.25
b    0.50
dtype: float64

In [73]:
# masking
data[(data > 0.3) & (data < 0.8)]

b    0.50
c    0.75
dtype: float64

In [74]:
# fancy indexing
data[['a', 'e']]

a    0.25
e    1.25
dtype: float64

### Indexers: loc, iloc, and ix

In [75]:
data = pd.Series(['a', 'b', 'c'],
                 index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [87]:
# explicit index when indexing
data[3]

'b'

In [82]:
# implicit index when indexing
data[1:3]

3    b
5    c
dtype: object

Because of the potential confusion in the case of integer indexes, Pandas provides some special *indexers* attributes that explicitly expose certain indexing schemes. These are not functional methods, but attributes that expose a particular slicing interface to the data in the Series.

First, the `loc` attribute allows indexing and slicing that always references the explicit index:

In [83]:
data.loc[1]

'a'

In [84]:
data.loc[1:3]

1    a
3    b
dtype: object

The `iloc` attribute allows indexing and slicing that always references the implicit Python-style index:

In [88]:
data.iloc[1]

'b'

In [89]:
data.loc[1:3]

1    a
3    b
dtype: object

## Data Selection in DataFrame

In [90]:
### DataFrame as a dictionary

In [91]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area,
                     'pop': pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [92]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [93]:
# acces as an attribute
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [94]:
data.area is data['area']

True

though this is a useful shorthand, it does not work for all cases!

for example, if the column names are not strings, or if the column names conflict with methods of the DataFrame, this attribute-style access if not possible.

For example, the DataFrame has a pop() method, so data.pop will point to this rather than the "pop" column:

In [95]:
data.pop is data['pop']

False

In particular, avoid the temptation to try column assignmetn via attribute, i.e, use `data['pop'] = z` rather than `data.pop = z`.

In [96]:
# Add new column
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

### DataFrame as two dimensional array

In [97]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [98]:
data.keys

<bound method NDFrame.keys of               area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763>

In [99]:
# transpose the full DataFrame to swap rows and cols
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [104]:
# here are shortcomings
# passsing an index to an array accesses a row
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [102]:
# passing a single "index" accesses a colum

In [103]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [106]:
data.iloc[:3, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [107]:
data.loc[:'Illinois', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [112]:
# masking and fancy indexing
data.loc[data.density > 100, ['pop', 'density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [113]:
# modify
data.iloc[0, 2] = 90
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

### Additional indexing conventions

while indexing refers to columns, slicing refers to rows

In [114]:
data['Florida':'Illinois']

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [116]:
# can be dun by number instead of index
data[3:]

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [117]:
# direct masking ops are also interpreted row-wise
data[data.density > 100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121

# Operating on Data in Pandas

## Ufuncs: Index Preservation

In [119]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int32

In [120]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
                  columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

If we apply a NumPy ufunc on either of these objects, the result will be another Pandas object *with the indices preserved*:

In [121]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [122]:
# a slightly more complex calculation
np.sin(df * np.pi / 4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

## UFuncs: Index Alignment

### Index alignment in Series

In [123]:
# combing two different data sources
# find only the top three US States by area
# and the top three US states by pop
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')

In [125]:
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [128]:
area.index.union(population.index)

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [129]:
# any missing value is default to NaN
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [130]:
# replace NaN with a default value
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

### Index alignment in DataFrame

In [134]:
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                 columns=list('AB'))

In [135]:
A

    A   B
0   9  15
1  14  14

In [136]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
                 columns=list('BAC'))
B

   B  A  C
0  2  6  3
1  8  2  4
2  2  6  4

In [137]:
A + B

      A     B   C
0  15.0  17.0 NaN
1  16.0  22.0 NaN
2   NaN   NaN NaN

The indices are aligned correctly irrespective of their order in the two objects, and indices in the result are sorted.

In [139]:
fill = A.stack().mean()
A.add(B, fill_value=fill)

      A     B     C
0  15.0  17.0  16.0
1  16.0  22.0  17.0
2  19.0  15.0  17.0

## Ufuncs: operations between DataFrame and Series

When performing operations between a DataFrame and Series, the index and column alignment is similarly maintained. operations between a DataFrame and a Series are similar to operations between a two-dimensional and one-dimensional NumPy array.

In [143]:
# rng = np.random.RandomState(42)

In [144]:
A = rng.randint(10, size=(3, 4))
A

array([[7, 2, 5, 4],
       [1, 7, 5, 1],
       [4, 0, 9, 5]], dtype=int32)

In [145]:
A - A[0]

array([[ 0,  0,  0,  0],
       [-6,  5,  0, -3],
       [-3, -2,  4,  1]], dtype=int32)

In [146]:
df = pd.DataFrame(A, columns=list('QRST'))
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -6  5  0 -3
2 -3 -2  4  1

In [147]:
# column-wise op
df.subtract(df['R'], axis=0)

   Q  R  S  T
0  5  0  3  2
1 -6  0 -2 -6
2  4  0  9  5

In [148]:
halfrow = df.iloc[0, ::2]
halfrow

Q    7
S    5
Name: 0, dtype: int32

In [149]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -6.0 NaN  0.0 NaN
2 -3.0 NaN  4.0 NaN

# Handling Missing Data

## Missing Data in Pandas

Pandas uses sentinels for missing data, two existing Python null values: the special floating-point `NaN` value, and the Python `None` object. There are some side effects, but in practice, this has a good compromise in most cases of interest.

### `None`: Pythonic missing data

`None` is a Python object, so it cannot be used in any arbitrary NumPy/Pandas array, but only in arrays with data type `objects (arrays of Python objects):

In [150]:
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [151]:
for dtype in ['object', 'int']:
    print('dtype = ', dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype =  object
95.6 ms ± 3.62 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype =  int
995 μs ± 9.46 μs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [152]:
# error for aggregation method due to None value
vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

### `NaN`: Missing numerical data

`NaN` is a special floating-point value recognized by all systems that use the standard IEEE floating-point representation

In [154]:
vals2 = np.array([1, np.nan, 3, 4])
vals2.dtype

dtype('float64')

NumPy chose a native floating-point type for this array: this means that unlike the object array from before, this array supports fast operations pushed into compiled code.

Note that `NaN` affects all operations with result of `NaN`.

In [155]:
1 + np.nan

nan

In [156]:
0 * np.nan

nan

In [157]:
vals2.sum(), vals2.min(), vals2.max()

(np.float64(nan), np.float64(nan), np.float64(nan))

In [159]:
# ignore missing values -> return real values
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, np.float64(1.0), np.float64(4.0))

### NaN and None in Pandas

Pandas is built to handle both NaN and none nearly interchangeably, converting between them where appropriate:

In [160]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [161]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int64

In [162]:
x[0] = None
x # Pandas auto type-casts and upcasts to floating-point type

0    NaN
1    1.0
dtype: float64

## Operating on Null Values

Pandas treats `None` and `NaN` as essentially interchangeable for missing or null values.

* `isnull()`: Generate a boolean mask indicating missing values
* `notnull()`: Opposite of `isnull()`
* `dropna()`: Return a filtered version of the data
* `fillna()`: Return a copy of the data with missing values filled or imputed

### Detecting null values

In [166]:
data = pd.Series([1, np.nan, 'hello', None])
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [167]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [168]:
# use as a mask
data[data.notnull()]

0        1
2    hello
dtype: object

In [169]:
data[data.isnull()]

1     NaN
3    None
dtype: object

### Dropping null values

In [170]:
data.dropna()

0        1
2    hello
dtype: object

In [171]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [173]:
# drop all rows by default
df.dropna()

     0    1  2
1  2.0  3.0  5

In [174]:
# drop all columns
df.dropna(axis=1)

   2
0  2
1  5
2  6

But this drops some good data as well; we might rather be interested in dropping rows or columns with *all* NA values, or a majority of NA values. This can be specified through the `how` and `thresh` parameters, which allow fine control of the number of nulls to allow through.

The default is `how='any'`, such that any row or column (depending on the `axis` keyword) containing a null value will be dropped. `how='all'` will only drop rows/cols that are *all* null values:

In [175]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [176]:
df.dropna(axis='columns',
          how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

the `thresh` parameter lets us specify a minimum number of non-null values for the row/col to be kept:

In [179]:
df.dropna(axis='rows',
          thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

### Filling null values

In [180]:
data = pd.Series([1, np.nan, 2, None, 3],
                 index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [181]:
# Fill NA entries with 0
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [182]:
# forward-fill
data.fillna(method='ffill')

C:\Users\linho\AppData\Local\Temp\ipykernel_7968\3777990566.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [188]:
data.ffill()

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [189]:
data.bfill()

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [190]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [192]:
df.fillna(value=0)

     0    1  2    3
0  1.0  0.0  2  0.0
1  2.0  3.0  5  0.0
2  0.0  4.0  6  0.0

In [194]:
df.ffill(axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

In [195]:
df.ffill(axis=0)

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  2.0  4.0  6 NaN

In [197]:
df.bfill(axis=1)

     0    1    2   3
0  1.0  2.0  2.0 NaN
1  2.0  3.0  5.0 NaN
2  4.0  4.0  6.0 NaN

In [198]:
df.bfill(axis=0)

     0    1  2   3
0  1.0  3.0  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

# Hierarchical Indexing

## A Multiply Indexed Series

### The bad way

In [199]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [200]:
pop[('California', 2010):('Texas', 2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [201]:
pop[[i for i in pop.index if i[1] == 2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

### The Better Way: Pandas MultiIndex

In [203]:
# Create a multi-index from the tuples
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [204]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [205]:
pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [206]:
pop['Texas', :]

2000    20851820
2010    25145561
dtype: int64

### MultiIndex as extra dimension

`unstack()` method converts a multiply indexed Series into an indexed DataFrame

In [208]:
pop_df = pop.unstack()

In [209]:
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [210]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [211]:
# Add another column of demographic data for each state at each year
pop_df = pd.DataFrame({'total': pop,
                       'under18': [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [212]:
f_u18 = pop_df['under18'] / pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

## Methods of MultiIndex Creation

In [213]:
df = pd.DataFrame(np.random.rand(4, 2),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=['data1', 'data2'])
df

        data1     data2
a 1  0.017396  0.407394
  2  0.494459  0.634922
b 1  0.070914  0.954877
  2  0.856585  0.434918

If we pass a dictionary with appropriate tuples as keys, Pandas will automatically recognize this and use `MultiIndex` by default:

In [214]:
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}

pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

## Explicit MultiIndex constructors

In [215]:
# from a simple list of arrays giving the index values within each level
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'],
                           [1, 2, 1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [216]:
# from a list of tuples giving the mutiple index values of each point
pd.MultiIndex.from_tuples([('a', 1),
                           ('a', 2),
                           ('b', 1),
                           ('b', 2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [218]:
# from a Cartesian product of single indices
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [221]:
# using its internal encoding by passing levels and codes
pd.MultiIndex(levels=[['a', 'b'], [1, 2]],
              codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

### MultiIndex level names

In [225]:
# setting names for indices
pop.index.names = ['state', 'year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

### MultiIndex for columns

In a DataFrame, the rows and columns are completely symetric, as just as the rows can have multiple levels of indices, the columns can have multiple levels as well.

In [227]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])

# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

# create DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      37.0  34.4  40.0  37.8  27.0  36.7
     2      41.0  35.2  36.0  36.9  18.0  37.4
2014 1      51.0  36.5  44.0  36.0  39.0  35.8
     2      57.0  35.6  29.0  38.7  39.0  36.3

In [228]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      40.0  37.8
     2      36.0  36.9
2014 1      44.0  36.0
     2      29.0  38.7

## Indexing and Slicing a MultiIndex

In [229]:
### Mutiply Indexed Series

In [230]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [232]:
pop['California', 2000].item()

33871648

In [233]:
# partial indexing
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [235]:
pop[:, 2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [237]:
pop.loc['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [238]:
# selection based on Boolean masks
pop[pop > 22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [239]:
# selection based on fancy indexing
pop[['California', 'Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

### Multiply indexed DataFrames

In [240]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      37.0  34.4  40.0  37.8  27.0  36.7
     2      41.0  35.2  36.0  36.9  18.0  37.4
2014 1      51.0  36.5  44.0  36.0  39.0  35.8
     2      57.0  35.6  29.0  38.7  39.0  36.3

In [244]:
# columns are primary in DataFrame
health_data['Guido', 'HR']

year  visit
2013  1        40.0
      2        36.0
2014  1        44.0
      2        29.0
Name: (Guido, HR), dtype: float64

In [245]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      37.0  34.4
     2      41.0  35.2

In [246]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        37.0
      2        41.0
2014  1        51.0
      2        57.0
Name: (Bob, HR), dtype: float64

In [247]:
health_data.loc[:, ('Sue', 'Temp')]

year  visit
2013  1        36.7
      2        37.4
2014  1        35.8
      2        36.3
Name: (Sue, Temp), dtype: float64

In [248]:
# wont work
health_data.loc[(:, 1), (:, 'HR')]

SyntaxError: invalid syntax (4280363760.py, line 2)

In [251]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      37.0  40.0  27.0
2014 1      51.0  44.0  39.0

## Rearrange Multi-Indices

### Sorted and unsorted indices

*Many of the `MultiIndex` slicing operation will fail if the index is not sorted.*

In [257]:
index = pd.MultiIndex.from_product([['a', 'c', 'b'],
                                    [1, 2]])
data = pd.Series(np.random.rand(6),
                 index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.393854
      2      0.339998
c     1      0.083220
      2      0.869573
b     1      0.281723
      2      0.741689
dtype: float64

In [258]:
try:
    data['a':'b']
except KeyError as e:
    print(type(e))
    print(e)

<class 'pandas.errors.UnsortedIndexError'>
'Key length (1) was greater than MultiIndex lexsort depth (0)'

In [259]:
data = data.sort_index()
data

char  int
a     1      0.393854
      2      0.339998
b     1      0.281723
      2      0.741689
c     1      0.083220
      2      0.869573
dtype: float64

In [260]:
data['a':'b']

char  int
a     1      0.393854
      2      0.339998
b     1      0.281723
      2      0.741689
dtype: float64

### Stacking and unstacking indices

In [261]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [262]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [263]:
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

### Index setting and resetting

Another way to rearrange hierarchical data is to to turn the index labels into columns; this can be accomplished with the `reset_index` method. Calling this on the population dictionary will result in a DataFrame with a *state* and *year* column holding the information that was formerly in the index.

In [264]:
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [266]:
# returns a multiply indexed DataFrame
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

## Data Aggregation on Multi-Indices

In [267]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      37.0  34.4  40.0  37.8  27.0  36.7
     2      41.0  35.2  36.0  36.9  18.0  37.4
2014 1      51.0  36.5  44.0  36.0  39.0  35.8
     2      57.0  35.6  29.0  38.7  39.0  36.3

In [274]:
# average-out the measurements in the two visits each year
data_mean = health_data.mean()
data_mean

subject  type
Bob      HR      46.500
         Temp    35.425
Guido    HR      37.250
         Temp    37.350
Sue      HR      30.750
         Temp    36.550
dtype: float64

In [278]:
data_mean.mean(axis=0)

np.float64(37.30416666666667)